espressif/arduino-esp32/tools/ide-debug/svd/esp32c2.svd
        <register>
          <name>RTC_FASTMEM_CONFIG</name>
          <description>fast memory config register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x7FF00000</resetValue>
          <fields>
            <field>
              <name>RTC_MEM_CRC_START</name>
              <description>Set 1 to start the CRC of RTC memory</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_MEM_CRC_ADDR</name>
              <description>This field is used to set address of RTC memory for CRC.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_MEM_CRC_LEN</name>
              <description>This field is used to set length of RTC memory for CRC based on start address.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_MEM_CRC_FINISH</name>
              <description>This bit stores the status of RTC memory CRC.1 means finished.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_FASTMEM_CRC</name>
          <description>reserved</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RTC_MEM_CRC_RES</name>
              <description>This field stores the CRC result of RTC memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REDUNDANT_ECO_CTRL</name>
          <description>eco register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REDUNDANT_ECO_DRIVE</name>
              <description>reg_redundant_eco_drive</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDUNDANT_ECO_RESULT</name>
              <description>reg_redundant_eco_result</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>clock gating register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>reg_clk_en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCLK_CONF</name>
          <description>system clock config register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>PRE_DIV_CNT</name>
              <description>This field is used to set the count of prescaler of XTAL_CLK.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOC_CLK_SEL</name>
              <description>This field is used to select soc clock.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_XTAL_FREQ</name>
              <description>This field is used to read xtal frequency in MHz.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_DIV_EN</name>
              <description>reg_clk_div_en</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_PVT</name>
          <description>mem pvt register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>MEM_PATH_LEN</name>
              <description>reg_mem_path_len</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_ERR_CNT_CLR</name>
              <description>reg_mem_err_cnt_clr</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MONITOR_EN</name>
              <description>reg_mem_pvt_monitor_en</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_TIMING_ERR_CNT</name>
              <description>reg_mem_timing_err_cnt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_VT_SEL</name>
              <description>reg_mem_vt_sel</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PVT_LVT_CONF</name>
          <description>mem pvt register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>COMB_PATH_LEN_LVT</name>
              <description>reg_comb_path_len_lvt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMB_ERR_CNT_CLR_LVT</name>
              <description>reg_comb_err_cnt_clr_lvt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COMB_PVT_MONITOR_EN_LVT</name>
              <description>reg_comb_pvt_monitor_en_lvt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PVT_NVT_CONF</name>
          <description>mem pvt register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>COMB_PATH_LEN_NVT</name>
              <description>reg_comb_path_len_nvt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMB_ERR_CNT_CLR_NVT</name>
              <description>reg_comb_err_cnt_clr_nvt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COMB_PVT_MONITOR_EN_NVT</name>
              <description>reg_comb_pvt_monitor_en_nvt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PVT_HVT_CONF</name>
          <description>mem pvt register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>COMB_PATH_LEN_HVT</name>
              <description>reg_comb_path_len_hvt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMB_ERR_CNT_CLR_HVT</name>
              <description>reg_comb_err_cnt_clr_hvt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COMB_PVT_MONITOR_EN_HVT</name>
              <description>reg_comb_pvt_monitor_en_hvt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PVT_ERR_LVT_SITE0</name>
          <description>mem pvt register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMB_TIMING_ERR_CNT_LVT_SITE0</name>
              <description>reg_comb_timing_err_cnt_lvt_site0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PVT_ERR_NVT_SITE0</name>
          <description>mem pvt register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMB_TIMING_ERR_CNT_NVT_SITE0</name>
              <description>reg_comb_timing_err_cnt_nvt_site0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PVT_ERR_HVT_SITE0</name>
          <description>mem pvt register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMB_TIMING_ERR_CNT_HVT_SITE0</name>
              <description>reg_comb_timing_err_cnt_hvt_site0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PVT_ERR_LVT_SITE1</name>
          <description>mem pvt register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMB_TIMING_ERR_CNT_LVT_SITE1</name>
              <description>reg_comb_timing_err_cnt_lvt_site1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PVT_ERR_NVT_SITE1</name>
          <description>mem pvt register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMB_TIMING_ERR_CNT_NVT_SITE1</name>
              <description>reg_comb_timing_err_cnt_nvt_site1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PVT_ERR_HVT_SITE1</name>
          <description>mem pvt register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMB_TIMING_ERR_CNT_HVT_SITE1</name>
              <description>reg_comb_timing_err_cnt_hvt_site1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PVT_ERR_LVT_SITE2</name>
          <description>mem pvt register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMB_TIMING_ERR_CNT_LVT_SITE2</name>
              <description>reg_comb_timing_err_cnt_lvt_site2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PVT_ERR_NVT_SITE2</name>
          <description>mem pvt register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMB_TIMING_ERR_CNT_NVT_SITE2</name>
              <description>reg_comb_timing_err_cnt_nvt_site2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PVT_ERR_HVT_SITE2</name>
          <description>mem pvt register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMB_TIMING_ERR_CNT_HVT_SITE2</name>
              <description>reg_comb_timing_err_cnt_hvt_site2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PVT_ERR_LVT_SITE3</name>
          <description>mem pvt register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMB_TIMING_ERR_CNT_LVT_SITE3</name>
              <description>reg_comb_timing_err_cnt_lvt_site3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PVT_ERR_NVT_SITE3</name>
          <description>mem pvt register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMB_TIMING_ERR_CNT_NVT_SITE3</name>
              <description>reg_comb_timing_err_cnt_nvt_site3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PVT_ERR_HVT_SITE3</name>
          <description>mem pvt register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMB_TIMING_ERR_CNT_HVT_SITE3</name>
              <description>reg_comb_timing_err_cnt_hvt_site3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DATE</name>
          <description>Version register</description>
          <addressOffset>0xFFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x02108190</resetValue>
          <fields>
            <field>
              <name>SYSTEM_REG_DATE</name>
              <description>reg_system_reg_date</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
